<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads the latest version of Affinity Photo 2 and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.doits.munki.AffinityPhoto2</string>
    <key>Input</key>
    <dict>
      <key>MUNKI_REPO_SUBDIR</key>
      <string>apps/serif</string>
      <key>NAME</key>
      <string>AffinityPhoto2</string>
      <key>pkginfo</key>
      <dict>
        <key>catalogs</key>
        <array>
          <string>testing</string>
          <string>production</string>
        </array>
        <key>category</key>
        <string>Graphics</string>
        <key>description</key>
        <string>Digital editing for photographers and bitmap artists.</string>
        <key>developer</key>
        <string>Serif</string>
        <key>display_name</key>
        <string>Affinity Photo 2</string>
        <key>name</key>
        <string>%NAME%</string>
        <key>unattended_install</key>
        <true/>
      </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.doits.download.AffinityPhoto2</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%pathname%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
      </dict>
    </array>
  </dict>
</plist>
