<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads the latest version of Linphone.</string>
    <key>Identifier</key>
    <string>com.github.doits.download.Linphone</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Linphone</string>
      <key>url</key>
      <string>https://linphone.org/releases/macosx/latest_app</string>
      <key>filename</key>
      <string>Linphone.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
      <dict>
	<key>Processor</key>
	<string>URLDownloader</string>
      </dict>
      <dict>
	<key>Processor</key>
	<string>EndOfCheckPhase</string>
      </dict>
    </array>
  </dict>
</plist>
