<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of GIMP from gimp.org.</string>
	<key>Identifier</key>
	<string>com.github.doits.download.Gimp-arm64</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>GIMP</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.4</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(?P&lt;dl_path&gt;//download.gimp.org/gimp/(?P&lt;version_base&gt;.*)/macos/gimp-(?P&lt;version&gt;.*)-arm64(-[0-9]*)?.dmg)</string>
				<key>url</key>
				<string>https://www.gimp.org/downloads/</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https:%dl_path%</string>
				<key>filename</key>
				<string>%NAME%-arm64.dmg</string>
				<key>CHECK_FILESIZE_ONLY</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
