<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads the latest version of draw.io-desktop.</string>
    <key>Identifier</key>
    <string>com.github.doits.download.drawio-desktop</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>draw.io</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
      <dict>
	<key>Processor</key>
	<string>GitHubReleasesInfoProvider</string>
	<key>Arguments</key>
	<dict>
	  <key>github_repo</key>
	  <string>jgraph/drawio-desktop</string>
	  <key>latest_only</key>
	  <true/>
	  <key>asset_regex</key>
	  <string>draw.io-universal-(.*).dmg</string>
	</dict>
      </dict>
      <dict>
	<key>Processor</key>
	<string>URLDownloader</string>
      </dict>
      <dict>
	<key>Processor</key>
	<string>EndOfCheckPhase</string>
      </dict>
    </array>
  </dict>
</plist>
