<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest release of KeePassXC from Github.</string>
	<key>Identifier</key>
	<string>com.github.doits.download.KeePassXC-arm64</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>KeePassXC</string>
		<key>ARCH</key>
		<string>arm64</string>
		<key>ASSET_REGEX</key>
		<string>KeePassXC-.*-%ARCH%\.dmg$</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>%ASSET_REGEX%</string>
				<key>github_repo</key>
				<string>keepassxreboot/keepassxc</string>
				<key>include_prereleases</key>
				<false/>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/KeePassXC.app</string>
				<key>requirement</key>
				<string>identifier "org.keepassxc.keepassxc" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = G2S7P7J672</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
