<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Mixxx.</string>
		<key>Identifier</key>
		<string>com.github.doits.download.Mixxx</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Mixxx</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.6.1</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://www.mixxx.org/download/</string>
					<key>re_pattern</key>
					<string>(?P&lt;url&gt;https://downloads.mixxx.org/mixxx-.*/(?P&lt;pkgname&gt;mixxx-(?P&lt;version&gt;.+)-osxintel.dmg))</string>
				</dict>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%url%</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>
