<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Latin Modern Fonts.</string>
		<key>Identifier</key>
		<string>com.github.doits.download.LatinModernFonts</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Latin Modern fonts</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.6.1</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>http://www.gust.org.pl/projects/e-foundry/latin-modern/download</string>
					<key>re_pattern</key>
					<string>(?P&lt;url&gt;http://www.gust.org.pl/projects/e-foundry/latin-modern/download/lm(?P&lt;version&gt;.+)otf.zip)</string>
				</dict>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%url%</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>
